In [1]:
import pandas as pd

In [2]:
# LISTA DE TUPLAS (COM VALORES DUPLICADOS):
estudantes = [
    ("Ally", 30,"Hill Valley"), ('Jhony', 33,"Bevelly Hills"),
    ("Manddy", 16, "Noth Carolina"), ("Claus", 56, "Manitoba"),
    ("Ally", 30,"Hill Valley"), ("Manddy", 16, "Noth Carolina")
]

In [3]:
for I in estudantes:
    print(I)

('Ally', 30, 'Hill Valley')
('Jhony', 33, 'Bevelly Hills')
('Manddy', 16, 'Noth Carolina')
('Claus', 56, 'Manitoba')
('Ally', 30, 'Hill Valley')
('Manddy', 16, 'Noth Carolina')

In [4]:
# TRANSFORMAMOS NUM DATAFRAME:
df = pd.DataFrame(estudantes, columns=["Name","Age","City"])

In [8]:
df.head(6)

     Name  Age           City
0    Ally   30    Hill Valley
1   Jhony   33  Bevelly Hills
2  Manddy   16  Noth Carolina
3   Claus   56       Manitoba
4    Ally   30    Hill Valley
5  Manddy   16  Noth Carolina

In [6]:
# PESQUISAR POR INFORMAÇÕES DUPLICADAS NO DATA FRAME
df[df.duplicated()]

     Name  Age           City
4    Ally   30    Hill Valley
5  Manddy   16  Noth Carolina

In [9]:
# FORMA BOOLEANA:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [10]:
# EXATAMENTE O QUE A DE CIMA FAZ (DAFAULT, FIRST -> ARG)
df.duplicated(keep='first')

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [14]:
# TRAZ SOMENTE OS VALORES DUPLICADOS:
df[df.duplicated(keep='first')]

     Name  Age           City
4    Ally   30    Hill Valley
5  Manddy   16  Noth Carolina

## AULA 52 -> DELETANDO VALORES DUPLICADOS:

In [18]:
df[df.duplicated(keep=False)]

     Name  Age           City
0    Ally   30    Hill Valley
2  Manddy   16  Noth Carolina
4    Ally   30    Hill Valley
5  Manddy   16  Noth Carolina

In [23]:
# De acordo com -> df[df.duplicated(keep='first')]
#..sabemos que os indices 4 & 5 estão repetidos:

df.drop(index=[4,5], inplace=True)

In [33]:
# 4 & 5 foram excluidas:
df.head()

     Name  Age           City
0    Ally   30    Hill Valley
1   Jhony   33  Bevelly Hills
2  Manddy   16  Noth Carolina
3   Claus   56       Manitoba

In [25]:
# CONFERINDO:
df[df.duplicated(keep='first')]

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [41]:
# CRIANDO OUTRO DF COM A MESMA SOURCE:

df2 = pd.DataFrame(estudantes, columns=["Name","Age","City"])

In [44]:
# coNFERINDO A DUPLICAÇÃO:
df2[df2.duplicated(keep='first')]

     Name  Age           City
4    Ally   30    Hill Valley
5  Manddy   16  Noth Carolina

In [45]:
# MÉTODO MAIS FACIL DE APAGAR QUAKISQUER FEATURES (ou linhas) DUPLICADAS:

df2.drop_duplicates(inplace=True)

In [46]:
df2.head()

     Name  Age           City
0    Ally   30    Hill Valley
1   Jhony   33  Bevelly Hills
2  Manddy   16  Noth Carolina
3   Claus   56       Manitoba

In [47]:
# CONFERINDO:
df2[df2.duplicated()]

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [48]:
# ALL RIGHT